# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
backbone1depth: 2  # layer channel multiple
anchors:
  - [3,6, 8,14, 18,26]  #4

backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  # 0-P1/2
   #640*640*3
   [-1, 3, C3, [8]], #
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  #2 0-P1/2
   [-1, 3, C3, [8]], #
   [[-1, 1], 1, Concat3, [16,1]],  #
   #640*640*16
   [-1, 3, C3, [32]], #
   [-1, 1, Conv, [64, 3, 2]],  
   #320*320*32
   [-1, 3, C3, [64]], #
   [-1, 1, Conv, [128, 3, 2]], 
   [-1, 3, C3, [128]], #9
   #160*160*64
   [-1, 1, Conv, [256, 3, 2]], 
   #80*80*128
   [-1, 9, C3, [256]], #
   #80*80*128
   [-1, 1, SPPF, [256, 5]],  #12
   #80*80*128
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [128, 1, 1]], # 80*80*64
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #160*160*64
   [[-1, 9], 1, Concat, [1]],  # cat backbone P3 160*160*128
   [-1, 1, C3, [128, False]],  # 17 (P3/8-small)  160*160*64
   

   [[16], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
